{"pageProps":{"post":{"title":"CS:GO Anubis Map Ultimate Review - Hellcase Blog","excerpt":"Like any other game, CS:GO does not stand still. Developers are trying to improve and update the game. Today we will talk about the latest patch, the changes in the map pool, and the opinions of the players about this update. In particular, we will t","content_html":"<p>\n Like any other game, CS:GO does not stand still. Developers are trying to improve and update the game. Today we will talk about the latest patch, the changes in the map pool, and the opinions of the players about this update. In particular, we will take a closer look at the Anubis map and its perspectives.\n</p>\n<div id=\"ez-toc-container\">\n<div>\n<p>\n   In article you will find:\n  </p>\n<span>\n</span>\n</div>\n<nav>\n<ul>\n<li>\n<a href=\"#Massive_Map_Update_Anubis_Replacing_Dust_II\" title=\"Massive Map Update Anubis Replacing Dust II\">\n     Massive Map Update Anubis Replacing Dust II\n    </a>\n</li>\n<li>\n<a href=\"#Quick_Hommage_on_Dust_II\" title=\"Quick Hommage on Dust II\">\n     Quick Hommage on Dust II\n    </a>\n</li>\n<li>\n<a href=\"#Differences_Similarities_Of_Dust_II_Anubis\" title=\"Differences &amp; Similarities Of Dust II &amp; Anubis\">\n     Differences &amp; Similarities Of Dust II &amp; Anubis\n    </a>\n</li>\n<li>\n<a href=\"#Pro-players_About_Anubis\" title=\"Pro-players About Anubis\">\n     Pro-players About Anubis\n    </a>\n</li>\n<li>\n<a href=\"#Anubis_Map_Locations_Overview\" title=\"Anubis Map Locations Overview\">\n     Anubis Map Locations Overview\n    </a>\n</li>\n<li>\n<a href=\"#What_We_Can_Expect_From_Anubis\" title=\"What We Can Expect From Anubis?\">\n     What We Can Expect From Anubis?\n    </a>\n</li>\n<li>\n<a href=\"#To_Wrap_Up\" title=\"To Wrap Up!\">\n     To Wrap Up!\n    </a>\n</li>\n</ul>\n</nav>\n</div>\n<h2>\n<span id=\"Massive_Map_Update_Anubis_Replacing_Dust_II\">\n</span>\n Massive Map Update Anubis Replacing Dust II\n <span>\n</span>\n</h2>\n<p>\n It’s hard to understand why Valve decided to sacrifice this particular map. After all, a few years ago, Dust II had already gone for reconstruction, after which it returned to the main map pool completely updated.\n</p>\n<p>\n Community and pro players got a reasonable question: “Why Dust II and not Mirage?”. In their opinion, the Mirage became very boring for the players, and it was worth removing it. Many consider the map not relevant because the last update on the Mirage was back in 2020, and it was not as significant as changes on Dust II of the same patch. Unfortunately, Valve has not given an official answer to this question.\n</p>\n<p>\n We, in turn, invite you to go back a little to the past, remember why everyone liked Dust II so much, and feel nostalgic.\n</p>\n<h3>\n<span id=\"Quick_Hommage_on_Dust_II\">\n</span>\n Quick Hommage on Dust II\n <span>\n</span>\n</h3>\n<p>\n Dust II is a legendary map that came to us from CS 1.6, where it was the most popular map of the game. The СS:GO version of this map was based on the architecture of the Moroccan city of El Sahrij, as evidenced by a sign near the terrorist base.\n</p>\n<div>\n<figure>\n<img alt=\"graffiti of a terrorist who holds 4 AWPs in his hands\" decoding=\"async\" height=\"524\" loading=\"lazy\" src=\"https://s.4tr.cc/RSFytAEF.png\" width=\"847\">\n</figure>\n</div>\n<p>\n They did this in honor of an interesting incident that happened during the match between Fnatic and Team EnVyus in the Grand Finals of ESL One Cologne 2015. The Swedish team decided to try their luck shooting through the central doors and bought 4 AWPs, leaving one JW with an\n <a href=\"https://bit.ly/3DJLlm8\" target=\"_blank\">\n  AK-47\n </a>\n . The decision was strange, but the result was worth it. Pronax killed apEX, and despite not being very useful, this strategy was considered very original. Viewers and commentators were extremely surprised by what Fnatic did in the grand finals and also praised the Swedes for their extraordinary thinking.\n</p>\n<figure>\n<div>\n<iframe allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen=\"\" frameborder=\"0\" height=\"360\" loading=\"lazy\" src=\"https://www.youtube.com/embed/asDtlvn7N5U?feature=oembed\" title=\"Fnatic 4 AWP peek VS Envyus\" width=\"640\">\n</iframe>\n</div>\n</figure>\n<p>\n On October 10, 2017, a new version of this map was released, and the graffiti was removed.\n</p>\n<p>\n\n  Although the map was removed\n \n from the competitive mode, Dust II will forever be in the hearts of many players. But what about his successor? Let’s compare Dust II and Anubis map in CS:GO.\n</p>\n<h3>\n<span id=\"Differences_Similarities_Of_Dust_II_Anubis\">\n</span>\n Differences &amp; Similarities Of Dust II &amp; Anubis\n <span>\n</span>\n</h3>\n<p>\n Despite the fact that the age difference between Dust II and Anubis is almost 20 years, these maps have a lot in common.\n</p>\n<ul>\n<li>\n  The architecture of both maps is made in the style of the countries of North Africa. (Dust II is Morocco and Anubis is Egypt).\n </li>\n<li>\n  On Anubis, as well as on Dust II (old version), the percentage of wins in the round is higher for the terrorist side.\n </li>\n<li>\n  Both maps were once removed from CS:GO.\n </li>\n<li>\n  The location of the sites on Anubis is divided by a space similar to the middle, just like in Dust II.\n </li>\n<li>\n  After adding these maps to the Competitive mode, both had bugs with invisible textures.\n </li>\n</ul>\n<p>\n The differences between Dust II and Anubis are much smaller, but they are all related to the gameplay.\n</p>\n<ul>\n<li>\n  The number and variety of textures on the Anubis map are totally superior to Dust II\n </li>\n<li>\n  There are more connections between key areas on the Anubis map.\n </li>\n<li>\n  On Anubis, it is much safer for counter-terrorists to get to a distant site (A site), unlike Dust II.\n </li>\n</ul>\n<p>\n Well, we talked about Anubis in comparison with his predecessor, and now let’s move on to the novelties that Anubis offers us.\n</p>\n<div>\n<figure>\n<img alt=\"anubis map\" decoding=\"async\" height=\"473\" loading=\"lazy\" src=\"https://s.4tr.cc/GJ0TPWVr.png\" width=\"842\">\n</figure>\n</div>\n<h3>\n<span id=\"Pro-players_About_Anubis\">\n</span>\n Pro-players About Anubis\n <span>\n</span>\n</h3>\n<p>\n\n  The best coach of the year\n \n according to Esports Awards 2022 – Andrii “B1ad3” Horodenskyi says:\n</p>\n<blockquote>\n<p>\n  “I think Anubis is a pretty simple map. It is quite easy to understand and find an approach to it. The only thing I’m afraid of is that everyone will understand this idea, and it will become difficult to play Anubis. But I hope that things will not be so fast and we will have some advantage.\n </p>\n<p>\n  However, we still need time (to fully prepare this map). We had a five-day boot camp and couldn’t spend all of our time on Anubis as we were focused on Npl.\n </p>\n<p>\n  I think we understand this map, but we need more time to work through it. Some details on it are still not perfect. Perhaps at BLAST, we will find several teams with whom we can train on Anubis”.\n </p>\n</blockquote>\n<p>\n Current Major winner Alexei “Qikert” Golubev commented on the update:\n</p>\n<blockquote>\n<p>\n  “Map pool of our team is constantly nerfed… nothing new. Time to become an expert on Anubis. By the way, I liked the M4A1-S fix.”\n </p>\n</blockquote>\n<p>\n The outsiders were the first team that picked Anubis at tier 1. Result 10 – 16 – victory for their opponents – Team Liquid.\n</p>\n<h3>\n<span id=\"Anubis_Map_Locations_Overview\">\n</span>\n Anubis Map Locations Overview\n <span>\n</span>\n</h3>\n<p>\n Structurally, the Anubis is a three-line map (three key directions) like Mirage, Inferno, Ancient, and Cache. But the developers, realizing the need for something new that diversifies the game on this map and will distinguish it from other structurally similar maps, made a number of excellent creative decisions. For a better understanding, we recommend that you familiarize yourself with the Anubis mini-map and\n <strong>\n<a href=\"https://bit.ly/3DJLlm8\" target=\"_blank\">\n   how it looks on the radar\n  </a>\n</strong>\n directly in CS:GO.\n</p>\n<div>\n<figure>\n<img alt=\"anubis map location\" decoding=\"async\" src=\"https://s.4tr.cc/Gck70Rpv.png\">\n</figure>\n</div>\n<p>\n Let’s look at the key positions where the whole action will take place. So, we will start with site A.\n</p>\n<div>\n<figure>\n<img alt=\"positions on the anubis map\" decoding=\"async\" height=\"483\" loading=\"lazy\" src=\"https://s.4tr.cc/PVH3SEom.jpeg\" width=\"859\">\n</figure>\n</div>\n<p>\n To get to point A, both sides have one safe path and an additional one through the “middle”. At the site itself, the thing that immediately catches your eye is the huge territory for planting the bomb. We can also see a walled elevation above the site, which is commonly called “Heaven” in the CS:GO. In general, defensive players have many positions to hold this plant.\n</p>\n<p>\n It is also worth mentioning that the top of the site is not covered by textures or skyboxes. This will allow players to use utility to execute the plant or retake it.\n</p>\n<p>\n “Middle” is likely to be subject to change. It seems awkward to push and hold. The presence of double doors will allow the counter-terrorists to hold the passage to the A site through the “Middle” in a more variable way.\n</p>\n<div>\n<figure>\n<img alt=\"A site on anubis map\" decoding=\"async\" height=\"479\" loading=\"lazy\" src=\"https://s.4tr.cc/tejwDwC7.jpeg\" width=\"852\">\n</figure>\n</div>\n<p>\n An interesting decision of the developers is the window in the middle. It allows you to drop onto the water with a further split attack on B. In the future, we will see if players use this feature in the game and how effective it is.\n</p>\n<div>\n<figure>\n<img alt=\"how effective is the anubis map\" decoding=\"async\" height=\"485\" loading=\"lazy\" src=\"https://s.4tr.cc/0F7gx0oi.jpeg\" width=\"862\">\n</figure>\n</div>\n<p>\n B plant is probably the best place on the map in terms of map design. Holding B site away from a pole or sewer will be one of the favorite positions of counter-terrorists in the game. The way that the site plays allows the super player to perform very dynamically. That is one of the most important positions on the entire map, and, if you have someone there who knows what they’re doing, your team will benefit.\n</p>\n<p>\n The B site is not impenetrable to the T side. Using two smokes and a two-pronged attack through the remaining “canal”, a successful B-site execution can be really satisfying.\n</p>\n<div>\n<figure>\n<img alt=\"site B on map anubis\" decoding=\"async\" height=\"470\" loading=\"lazy\" src=\"https://s.4tr.cc/8OyXoMab.jpeg\" width=\"836\">\n</figure>\n</div>\n<p>\n The important thing is that it’s not without counterplay. When these telltale signs of execution come out, they can be countered with counter-terrorist utility, molotovs, HE grenades, and smokes.\n</p>\n<div>\n<figure>\n<img alt=\"map of anubis csgo\" decoding=\"async\" height=\"486\" loading=\"lazy\" src=\"https://s.4tr.cc/bLVOGrc3.jpeg\" width=\"864\">\n</figure>\n</div>\n<h2>\n<span id=\"What_We_Can_Expect_From_Anubis\">\n</span>\n<br>\n What We Can Expect From Anubis?\n <span>\n</span>\n</h2>\n<p>\n First of all, we would like developers to improve the map as soon as possible. Remove bugs with grenades, especially molotovs, and invisible textures that interfere with the gameplay.\n</p>\n<p>\n We hope that the imbalance of the sides is a temporary phenomenon that will settle down after the players learn how to play for the defense side. Otherwise, the Anubis map may be removed for further development.\n</p>\n<p>\n If all of the above goes smoothly, then Anubis has every chance of becoming one of the most popular and pickable maps in CS:GO.\n</p>\n<h3>\n<span id=\"To_Wrap_Up\">\n</span>\n To Wrap Up!\n <span>\n</span>\n</h3>\n<p>\n The old goes away, and the new comes in its place. Without updates, the game would simply become irrelevant and would lose the interest of gamers. If you miss Dust II so much, you can always play it in Casual or Deathmatch mode. As for Anubis, the map has good prospects. If the developers continue to update and improve this map, it has every chance to establish itself in the\n \n  Сompetitive mode map pool\n \n . If you are interested in other maps, check out\n <a href=\"https://bit.ly/3DJLlm8\" target=\"_blank\">\n  our blog\n </a>\n !\n</p>\n"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}