{"pageProps":{"post":{"title":"CS:GO Source 2: Are These Rumors Legit?","excerpt":"Recently, more and more information and hype have appeared around the release of CS:GO on the new Source 2 engine. And yes, this is not just stuffing or a joke from the developers. Now we will try to figure out what form the update will take, what pl","content_html":"<p>\n Recently, more and more information and hype have appeared around the release of CS:GO on the new Source 2 engine. And yes, this is not just stuffing or a joke from the developers. Now we will try to figure out what form the update will take, what players think about it, and how it will affect the game as a whole.\n</p>\n<div id=\"ez-toc-container\">\n<div>\n<p>\n   In article you will find:\n  </p>\n<span>\n</span>\n</div>\n<nav>\n<ul>\n<li>\n<a href=\"#Valve_Might_Soon_Launch_Counter-Strike_2_What_We_Know_So_Far\" title=\"Valve Might Soon Launch Counter-Strike 2? What We Know So Far\">\n     Valve Might Soon Launch Counter-Strike 2? What We Know So Far\n    </a>\n</li>\n<li>\n<a href=\"#What_to_Expect_from_CS_GO_Source_2\" title=\"What to Expect from CS:GO Source 2?\">\n     What to Expect from CS:GO Source 2?\n    </a>\n</li>\n<li>\n<a href=\"#Development_and_Release_Date\" title=\"Development and Release Date\">\n     Development and Release Date\n    </a>\n</li>\n<li>\n<a href=\"#New_Features_and_Improvements\" title=\"New Features and Improvements\">\n     New Features and Improvements\n    </a>\n</li>\n<li>\n<a href=\"#What_CS_GO_Pros_Think_About_Source_2\" title=\"What CS:GO Pro’s Think About Source 2\">\n     What CS:GO Pro’s Think About Source 2\n    </a>\n</li>\n<li>\n<a href=\"#Future_of_CS_GO_Esports_Scene\" title=\"Future of CS:GO &amp; Esports Scene\">\n     Future of CS:GO &amp; Esports Scene\n    </a>\n</li>\n<li>\n<a href=\"#To_Wrap_Up\" title=\"To Wrap Up!\">\n     To Wrap Up!\n    </a>\n</li>\n<li>\n<a href=\"#CS_GO_2_FAQ\" title=\"CS:GO 2 FAQ\">\n     CS:GO 2 FAQ\n    </a>\n</li>\n</ul>\n</nav>\n</div>\n<h2>\n<span id=\"Valve_Might_Soon_Launch_Counter-Strike_2_What_We_Know_So_Far\">\n</span>\n Valve Might Soon Launch Counter-Strike 2? What We Know So Far\n <span>\n</span>\n</h2>\n<p>\n The first official announcement that Valve was working on the creation of Sources 2 appeared back in 2015. To date, several games have already been released on this engine, including Dota 2, Aperture Robot Repair, The Lab, Destinations Artifact, and Half-Life: Alyx.\n</p>\n<p>\n As for CS:GO, there are no photos or any other reliable information in the public domain about exactly how the game will look on the new engine. But the main reason for the transition of the game to a new version of the engine most likely was the fact that Source 1 had already exhausted its capabilities. For further updates and development of the game, Valve needs to transfer it to a new engine with a wider range of features. But in what way will they present it to the community?\n</p>\n<h2>\n<span id=\"What_to_Expect_from_CS_GO_Source_2\">\n</span>\n What to Expect from CS:GO Source 2?\n <span>\n</span>\n</h2>\n<p>\n As we mentioned earlier, no in-game photos or videos about CS:GO on the Source 2 engine appeared on the network. In such cases, it is customary to listen to the words of insiders. The most common question from users in the comments under such articles is:\n</p>\n<blockquote>\n<p>\n<strong>\n<em>\n    “What will happen to skins and other in-game items and the economy of the CS:GO market as a whole?”.\n   </em>\n</strong>\n</p>\n</blockquote>\n<div>\n<figure>\n<img alt=\"counter strike source 2\" decoding=\"async\" height=\"360\" loading=\"lazy\" sizes=\"(max-width: 868px) 100vw, 868px\" src=\"https://s.4tr.cc/f946EZVu.jpeg\" width=\"868\">\n</figure>\n</div>\n<p>\n On a recent “Cyber” podcast, an insider named “Gabe Follower” gave out quite a lot of information:\n</p>\n<blockquote>\n<p>\n<strong>\n<em>\n    “After launching the game, you will have a choice: the Source 1 version of the game, the Source 2 version, and the Source 2 version with the developer tools running.”\n   </em>\n</strong>\n</p>\n</blockquote>\n<p>\n Based on this, we can say that Valve has already figured out how to import your skins to the new engine. So nothing will happen to your skin in the near future. There is no reason to ruin something that works so well.\n</p>\n<p>\n Also, this insider added that nothing would change for the average player on the new engine. During the beta test, you will be unpleasant, as it may lag, there may be graphical bugs, plus optimization problems. Most likely, players will not even notice the difference after the transition.\n</p>\n<p>\n In this case, the only way to prove the truth is to wait for the official release.\n</p>\n<h3>\n<span id=\"Development_and_Release_Date\">\n</span>\n Development and Release Date\n <span>\n</span>\n</h3>\n<p>\n Valve likes to keep the community in the dark, but some facts already show that we will soon have a big update in CS:GO. One of the authoritative insiders, Richard Lewis, published an article on his\n \n  official website\n \n in which he shared information from an anonymous source regarding Counter-Strike 2.\n</p>\n<div>\n<figure>\n<img alt=\"Richard Lewis\" decoding=\"async\" height=\"560\" loading=\"lazy\" sizes=\"(max-width: 910px) 100vw, 910px\" src=\"https://s.4tr.cc/2g1gP0Qv.jpeg\" width=\"910\">\n</figure>\n</div>\n<p>\n<em>\n  source:\n </em>\n\n  https://richardlewis.substack.com/p/sources-yes-counter-strike-2-is-real\n \n</p>\n<p>\n According to him, developers will represent the beta version of Counter-Strike on Source 2 by the end of March this year. And some pro players have already come to the Valve office and tested the new CS. Now the developers are fully engaged in finalizing the new version of the game. Precisely because of this, Valve wasn’t updating CS:GO for so long.\n</p>\n<p>\n Gabe Follower also commented on the development process:\n</p>\n<blockquote>\n<p>\n<strong>\n<em>\n    “After launching the game, you will have a choice: the Source 1 version of the game, the Source 2 version, and the Source 2 version with the developer tools running.”\n   </em>\n</strong>\n</p>\n</blockquote>\n<p>\n Also, these insiders spoke about possible improvements in the game.\n</p>\n<h3>\n<span id=\"New_Features_and_Improvements\">\n</span>\n New Features and Improvements\n <span>\n</span>\n</h3>\n<p>\n Counter-Strike 2 should primarily improve the graphics and optimization of the game. So players with low-spec PCs may experience lower FPS. But that’s just guesswork because we know that Valve wants to play CS even on a “wooden PC”.\n</p>\n<p>\n Developers will also switch the servers to 128 tickrate. That will equalize competition with Valorant. Whether this will be presented already in the beta version is still unknown. The developers are also working on a system for selecting players in matchmaking and anti-cheat. That may lead to the fact that platforms such as Faceit will no longer be necessary, except as a way to break into eSports. Speaking of the pro scene, some players have already expressed their opinion about the future release.\n</p>\n<h2>\n<span id=\"What_CS_GO_Pros_Think_About_Source_2\">\n</span>\n What CS:GO Pro’s Think About Source 2\n <span>\n</span>\n</h2>\n<p>\n As we previously mentioned, some pro players have already managed to play the new version of the game. But apparently, they can not fully disclose the information. For example, Owen “smooya” Butterfield made the following tweet:\n</p>\n<blockquote>\n<p>\n<strong>\n<em>\n    “Goodnight, nice hour session on the CS2 beta in the books. Can’t believe they removed the AWP from the game tbh..”\n   </em>\n</strong>\n</p>\n</blockquote>\n<p>\n Most likely, this is not true, and the AWP will remain, and smooya is just teasing his followers. He also jokingly throws the ip of the servers in the CS saying that this is a “Counter-Strike 2 server”.\n</p>\n<figure>\n<div>\n<blockquote data-dnt=\"true\" data-width=\"550\">\n<p dir=\"ltr\" lang=\"en\">\n    connect 185.242.115.38:27415\n    <br>\n<br>\n    Counter Strike 2 Pistol Deathmatch\n   </p>\n   — Owen Butterfield (@smooyacs)\n   <a href=\"https://twitter.com/smooyacs/status/1632909001615724556?ref_src=twsrc%5Etfw\" target=\"_blank\">\n    March 7, 2023\n   </a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\">\n</script>\n</div>\n</figure>\n<p>\n Ali “jame” Dzhami, the winner of the last major, gave his comment about Sources 2:\n</p>\n<p>\n “I hope the interface will not change. Have I played 20,000 hours in vain? Let’s leave everything as it is. I hope everything will be like in DOTA 2: The game will remain the same, but the mechanics will not change. Only optimization will change. To be honest, I’m already tired of learning something new .”\n</p>\n<p>\n Some former pro players said they would love to come back into the game when Source 2 comes out.\n</p>\n<figure>\n<div>\n<blockquote data-dnt=\"true\" data-width=\"550\">\n<p dir=\"ltr\" lang=\"en\">\n    If CS2 comes out, I'm making a comeback\n   </p>\n   — jdm (@jdmarzano)\n   <a href=\"https://twitter.com/jdmarzano/status/1631033438378823680?ref_src=twsrc%5Etfw\" target=\"_blank\">\n    March 1, 2023\n   </a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\">\n</script>\n</div>\n</figure>\n<p>\n The opinions of the players differ, some hype on this, and some hope that this will not be a blow to his career on the pro scene.\n</p>\n<h2>\n<span id=\"Future_of_CS_GO_Esports_Scene\">\n</span>\n Future of CS:GO &amp; Esports Scene\n <span>\n</span>\n</h2>\n<p>\n Big changes are coming, and it’s 100% good for a discipline like CS. We all remember the transition from 1.6 to Global Offensive at first, many hated the new version, but as we can see now, it perfectly replaced the old one and made a huge contribution to the development of eSports.\n</p>\n<p>\n As for the scenes, some tournament organizers already gave comments about the near future. ESL stated that “all tournaments will be played on the old version of CS:GO until CS2 is stable”. Organization “BLAST” refused any kind of comments on this topic.\n</p>\n<p>\n So it’s too early to talk about the imminent collapse of the CS. Even if the update is not very successful, we are sure this discipline will continue to be at the top.\n</p>\n<h2>\n<span id=\"To_Wrap_Up\">\n</span>\n To Wrap Up!\n <span>\n</span>\n</h2>\n<p>\n The update will be released soon. It is not yet clear what it will look like because there is no official statement from Valve – all information about the update can be considered rumors. If you want to be the first to know about the update, monitor our\n <a href=\"https://bit.ly/3DJLlm8\" target=\"_blank\">\n  blog\n </a>\n for the latest news about CS:GO is constantly coming out here and possibly soon with Counter-Strike 2.\n</p>\n<h2>\n<span id=\"CS_GO_2_FAQ\">\n</span>\n CS:GO 2 FAQ\n <span>\n</span>\n</h2>\n<div>\n<div id=\"faq-question-1678371627147\">\n<strong>\n   Is CS:GO 2 real?\n  </strong>\n<p>\n   Yes, this is true. But so far, it is unknown whether Valve will rebrand the game or the old name will remain, and only the engine will change.\n  </p>\n</div>\n</div>\n"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}