{"pageProps":{"post":{"title":"Player preferences for Counter-Strike 2 Features - Hellcase Blog","excerpt":"With Counter-Strike 2 launching this summer, developers will bring new smoke grenade mechanics, upgraded graphics, a new audio system, and more. As we approach the release date, more details about new features will be revealed. However, the CS commun","content_html":"<p>\n With Counter-Strike 2 launching this summer, developers will bring new smoke grenade mechanics, upgraded graphics, a new audio system, and more. As we approach the release date, more details about new features will be revealed.\n</p>\n<p>\n However, the CS community has already spoken and shared their thoughts on what the new game will need to be even better. In this article, we will review a few changes players have offered, including features that could be “borrowed” from DOTA 2, and analyze if they will impact the game positively.\n</p>\n<div id=\"ez-toc-container\">\n<div>\n<p>\n   In article you will find:\n  </p>\n<span>\n</span>\n</div>\n<nav>\n<ul>\n<li>\n<a href=\"#New_Ranking_System_In-Game_Ladders_in_Counter-Strike_2\" title=\"New Ranking System &amp; In-Game Ladders in Counter-Strike 2\">\n     New Ranking System &amp; In-Game Ladders in Counter-Strike 2\n    </a>\n</li>\n<li>\n<a href=\"#New_Weapons\" title=\"New Weapons\">\n     New Weapons\n    </a>\n</li>\n<li>\n<a href=\"#The_Ability_To_Sell_a_Weapon\" title=\"The Ability To Sell a Weapon\">\n     The Ability To Sell a Weapon\n    </a>\n</li>\n<li>\n<a href=\"#Marks_on_Radar\" title=\"Marks on Radar\">\n     Marks on Radar\n    </a>\n</li>\n<li>\n<a href=\"#In-Game_Knowledge_Base\" title=\"In-Game Knowledge Base\">\n     In-Game Knowledge Base\n    </a>\n</li>\n<li>\n<a href=\"#Weekly_In-Game_Tournaments\" title=\"Weekly In-Game Tournaments\">\n     Weekly In-Game Tournaments\n    </a>\n</li>\n<li>\n<a href=\"#Major_Battle_Passes\" title=\"Major Battle Passes\">\n     Major Battle Passes\n    </a>\n</li>\n<li>\n<a href=\"#To_Wrap_Up\" title=\"To Wrap Up!\">\n     To Wrap Up!\n    </a>\n</li>\n</ul>\n</nav>\n</div>\n<h2>\n<span id=\"New_Ranking_System_In-Game_Ladders_in_Counter-Strike_2\">\n</span>\n<strong>\n  New Ranking System &amp; In-Game Ladders in Counter-Strike 2\n </strong>\n<span>\n</span>\n</h2>\n<p>\n Counter-Strike: Global Offensive was the first game of the series to introduce official matchmaking and ranking system.\n</p>\n<p>\n According to CS:GO players, the current ranking system lacks transparency. It is sometimes frustrating not to understand if you are progressing enough to rank up, how many more wins are needed, and if you are close to a new rank.\n</p>\n<div>\n<figure>\n<img alt=\"cs:go ranking system\" decoding=\"async\" height=\"360\" loading=\"lazy\" sizes=\"(max-width: 868px) 100vw, 868px\" src=\"https://s.4tr.cc/fQ4ufgoq.jpeg\" width=\"868\">\n</figure>\n</div>\n<p>\n Apart from that, the current CS:GO ranking system is limited. Once you reach the sacramental Global Elite, there is nothing else to reach in regular matchmaking. Without any motivation to grind new heights, because there simply are none in CS:GO, players turn to FACEIT and ESEA for new experiences.\n</p>\n<p>\n\n  FACEIT\n \n , a third-party matchmaking platform, has a completely different ranking system than the in-game one, and it is much better. On FACEIT, you can be on Levels from 1 to 10. The system is transparent, as you know how many ELO you currently have, how many ELO points you need to rank up, and how many are at stake in every match.\n</p>\n<p>\n After reaching Level 10, the grinding process does not stop like with Global Elite in CS:GO. You need at least 2001 ELO points to get to Level 10, and after you do that, you can continue playing to reach the Top-100 of FACEIT and even try to set the record for the highest ELO ever.\n</p>\n<p>\n Every FACEIT user can see their place in national and regional rankings and detailed stats of their performance in their profile. This is another advantage of playing on FACEIT compared to regular in-game matchmaking.\n</p>\n<p>\n CS fans would love a reworked ranking system in Counter-Strike 2 that would be decent enough to compete with what FACEIT offers. In-game ladders will also add to the competition.\n</p>\n<figure>\n<div>\n  https://twitter.com/fribergCS/status/1638608959941517327?s=20\n </div>\n</figure>\n<figure>\n<div>\n<blockquote data-dnt=\"true\" data-width=\"550\">\n<p dir=\"ltr\" lang=\"en\">\n    This was always the problem with CS MM once you got Global Elite it was pointless. If they add in a top 500 system like Valorant has as well it would definitely keep people wanting to play on valve servers.\n   </p>\n   — Solid (@solid2q)\n   <a href=\"https://twitter.com/solid2q/status/1638616945401692161?ref_src=twsrc%5Etfw\" target=\"_blank\">\n    March 22, 2023\n   </a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\">\n</script>\n</div>\n</figure>\n<p>\n Valve has not announced it yet, and we do not know if it is coming. So, should we expect it anytime soon?\n</p>\n<h2>\n<span id=\"New_Weapons\">\n</span>\n<strong>\n  New Weapons\n </strong>\n<span>\n</span>\n</h2>\n<p>\n Last but not least, adding a new weapon (or even weapons) to the game is not the worst idea, and a part of the CS community accented that this is something they would like. New weapons can help maintain the interest of the existing player base and attract new players,\n</p>\n<p>\n There are two ways of adding weapons to a game. The first one is “one in, one out”, meaning when a new gun is added to a game, one of the existing ones should be deleted permanently or temporarily. This is not suitable for CS, as deleting a weapon will lead to skins for it becoming useless, and skins have become an integral part of the game.\n</p>\n<p>\n The other option for bringing a new weapon to a game is to add it as an alternative to another one already available for players. This way, players get a new weapon, the gameplay gets freshened up, and the in-game buy menu is not cluttered. Also, it provides players with customization options which is highly valued.\n</p>\n<figure>\n<img alt=\"weapons in CS:GO\n\" decoding=\"async\" height=\"360\" loading=\"lazy\" sizes=\"(max-width: 868px) 100vw, 868px\" src=\"https://s.4tr.cc/CndefNSk.jpeg\" width=\"868\">\n</figure>\n<p>\n Some CS:GO weapons have alternatives you can switch between in your in-game arsenal based on your preference. For example, here is the list of these weapons and their available alternatives:\n</p>\n<ul>\n<li>\n  M4A1-S or M4A4.\n </li>\n<li>\n  Tec-9 (for T), (Five-SeveN for CT), or CZ275-Auto.\n </li>\n<li>\n  Desert Eagle or R8 Revolver.\n </li>\n<li>\n  USP-S or P2000.\n </li>\n<li>\n  MP7 or MP5-SD.\n </li>\n</ul>\n<p>\n<a href=\"https://www.4tmr.com/r/XnabMPWX\" target=\"_blank\">\n  AK-47\n </a>\n is a powerful weapon exclusively available to the Terrorist side and is the most popular assault rifle in the game. However, it does not have an alternative like M4A4 and M4A1-S do. Bringing a new gun to the game that can become a decent alternative to AK-47 can freshen up the gameplay.\n</p>\n<p>\n Having a diverse range of weapons available in your matches sounds like a dream, right? Although we still are questioning if there will be any new weapons in Counter-Strike 2, our only option now is to wait for Valve’s official announcements and new leaks from data miners.\n</p>\n<h2>\n<span id=\"The_Ability_To_Sell_a_Weapon\">\n</span>\n<strong>\n  The Ability To Sell a Weapon\n </strong>\n<span>\n</span>\n</h2>\n<p>\n This is not a major change but is worth considering. It is not rare for a player to miss-click while in the buy menu and purchase a weapon different from what they wanted. Oftentimes, players who make this mistake are stuck with an unwanted weapon because they have no money left to buy the one they wanted in the first place.\n</p>\n<p>\n This problem could be solved by adding a feature that allows for selling the weapon the player bought. It will also help new players manage their budgets and learn the game’s economy because they can reverse their mistakes. Also, it will give an opportunity to reconsider round strategies.\n</p>\n<h2>\n<span id=\"Marks_on_Radar\">\n</span>\n<strong>\n  Marks on Radar\n </strong>\n<span>\n</span>\n</h2>\n<p>\n We already have marks in Counter-Strike: Global Offensive, and they even appear on the in-game radar. So, what else do we need? There is always room for improvement, and here is an idea that will better the gaming experience in Counter-Strike 2.\n</p>\n<p>\n Right now, you are only able to place marks around what you see on your screen. It means that if you are playing Mirage and on B site, you can only place marks on Aps, Plant, Kitchen, etc. You can not place marks on locations that are not visible to you.\n</p>\n<p>\n It makes it harder to communicate for players with no microphones or those who have started playing recently and have not learned maps and callouts yet. Adding the ability to place marks on any point of the map will make the process of communicating easier for both groups of players.\n</p>\n<h2>\n<span id=\"In-Game_Knowledge_Base\">\n</span>\n<strong>\n  In-Game Knowledge Base\n </strong>\n<span>\n</span>\n</h2>\n<p>\n In another Valve’s title, DOTA 2, players are able to learn about the mechanics, heroes, items, economy, and other game-related topics without the need to dig external resources for information.\n</p>\n<p>\n In the Learn tab, accessible for players from the DOTA 2 main menu, new players can learn everything they need for a solid start, and experienced players can freshen up their knowledge.\n</p>\n<p>\n This is extremely great for newcomers and makes adapting easier for new players. An in-game knowledge base is surely among the things that should be considered for Counter-Strike 2.\n</p>\n<h2>\n<span id=\"Weekly_In-Game_Tournaments\">\n</span>\n<strong>\n  Weekly In-Game Tournaments\n </strong>\n<span>\n</span>\n</h2>\n<p>\n DOTA 2 offers players Weekend Battle Cups, which are amateur tournaments with rewards. Each event is an eight-team single-elimination tournament subdivided by players’ skill groups and their regions.\n</p>\n<p>\n Bringing weekly battle cups to Counter-Strike 2, similar to those in Dota 2, will encourage players to work in teams and improve their skills to win in these events and get valuable prizes.\n</p>\n<p>\n Having weekly in-game tournaments everyone can participate in is a great way to add more fun and competitive spirit to Counter-Strike 2. By adding them, Valve can increase players’ engagement and allow casual gamers to feel the atmosphere of online tournaments.\n</p>\n<h2>\n<span id=\"Major_Battle_Passes\">\n</span>\n<strong>\n  Major Battle Passes\n </strong>\n<span>\n</span>\n</h2>\n<p>\n In DOTA 2, battle passes offer challenges and quests that players can complete to gain exclusive content, rewards, and cosmetics. There are seasonal battle passes for Summer and Fall Events, and those previously known as Compendiums, a part of the profit from which goes to fundraising for The International, an annual world championship tournament.\n</p>\n<p>\n With compendiums, The International has set multiple records for the biggest tournament prize pool, reaching an astronomical $40,018,195 in The International 2021. In CS:GO, on the other hand, the biggest prize pool reached only $2,000,000 in PGL Major Stockholm 2021, and it is top-75 of the\n \n  Largest Overall Prize Pools in Esports\n \n ranking.\n</p>\n<p>\n Bringing battle passes similar to those in DOTA 2 to help fundraising prize pools will likely be beneficial to Counter-Strike 2. Here are a few reasons why:\n</p>\n<ul>\n<li>\n<em>\n   Esports funding.\n  </em>\n</li>\n</ul>\n<p>\n Contributing a portion of battle pass sales to Major prize pools will make these events more exciting and lucrative for participants and attract a larger audience.\n</p>\n<ul>\n<li>\n<em>\n   Attracting more pro players.\n  </em>\n</li>\n</ul>\n<p>\n Talented gamers worldwide will pay more attention to Counter-Strike 2 if the prize pools of the tournaments will increase. The more attention the game gets, the more potential superstar pro players will play the game.\n</p>\n<ul>\n<li>\n<em>\n   Rewards for players.\n  </em>\n</li>\n</ul>\n<p>\n Battle passes should include truly exclusive rewards for those who complete the tasks and progress. There are a lot of types of cosmetic items in CS:GO, and we already know that they will all transfer to Counter-Strike 2 safely. Some rewards could be free-to-open cases, exclusive skins, stickers, pins, agents, etc.\n</p>\n<p>\n You might think that we already have operations in CS:GO instead, and battle passes are not needed. However, operations are not regular and do not fundraise Major prize pools.\n</p>\n<h3>\n<span id=\"To_Wrap_Up\">\n</span>\n<strong>\n  To Wrap Up!\n </strong>\n<span>\n</span>\n</h3>\n<p>\n We are sure that all these changes will positively impact the game. A new ranking system and in-game ladders are undoubtedly needed to maintain the grinding motivation, and new weapons will surely freshen up the gameplay. Do you have ideas of your own about the changes that you want to see implemented in Counter-Strike 2?\n</p>\n<p>\n There are new details on Counter-Strike 2 revealed daily, so visit our blog to stay updated. So far, we have covered the big announcement of Counter-Strike 2, the first gameplay details, bugs, and memes. Also, we explained how exactly the\n <a href=\"https://www.4tmr.com/r/XnabMPWX\" target=\"_blank\">\n  new sub-tick system\n </a>\n will better your Counter-Strike 2 experience.\n</p>\n<p>\n<a href=\"https://www.4tmr.com/r/XnabMPWX\" target=\"_blank\">\n  Explore our blog\n </a>\n for articles about Counter-Strike’s skins and other cosmetic items, in-depth game guides, and esports news. Stay tuned for more!\n</p>\n"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}