{"pageProps":{"post":{"title":"CS:GO Update Replaces Dust 2 with Anubis","excerpt":"Anubis is a community-made map created by the winners of the Mapcore Mapping Contest 2019: Roald, jakuza, and jd40. Valve first added Anubis to CS:GO’s Scrimmage map pool in May, 2019, and a week later, players got to play it in the Competitive mode.","content_html":"<p>\n Anubis is a community-made map created by the winners of the Mapcore Mapping Contest 2019: Roald, jakuza, and jd40. Valve first added Anubis to CS:GO’s Scrimmage map pool in May, 2019, and a week later, players got to play it in the Competitive mode.\n</p>\n<p>\n</p><blockquote data-dnt=\"true\" data-width=\"550\">\n<p dir=\"ltr\" lang=\"en\">\n   Today we're adding Anubis to the Active Duty map pool. Dust2 has been removed. We're also making adjustments to the M4A1-S and the AWP:\n   \n    https://t.co/SDjg8uaXs2\n   \n\n    pic.twitter.com/1h6YMkw0Mb\n   \n</p>\n  — CS:GO (@CSGO)\n  <a href=\"https://twitter.com/CSGO/status/1593727088506605568?ref_src=twsrc%5Etfw\" target=\"_blank\">\n   November 18, 2022\n  </a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\">\n</script>\n<p></p>\n<p>\n The CS:GO community was surprised by Valve’s decision to replace de_dust2 with de_anubis in the Active Duty map pool in November, 2022. Not only developers took away the map loved by millions of people, but also replaced it with a map that was full of technical issues and bugs at the moment.\n</p>\n<p>\n For example, Giovanni “Gio” Deniz noted that there were invisible textures on Anubis that would not let you throw your grenades through. It was a serious issue that could majorly impact the gameplay.\n</p>\n<p>\n</p><blockquote data-dnt=\"true\" data-width=\"550\">\n<p dir=\"ltr\" lang=\"en\">\n<a href=\"https://twitter.com/CSGO?ref_src=twsrc%5Etfw\" target=\"_blank\">\n    @CSGO\n   </a>\n   Wall is going trough mid of entrance on B Site\n   \n    pic.twitter.com/ygJNlyEPFq\n   \n</p>\n  — Giovanni Deniz 🇧🇷 (@gio_fps)\n  <a href=\"https://twitter.com/gio_fps/status/1593813321857519617?ref_src=twsrc%5Etfw\" target=\"_blank\">\n   November 19, 2022\n  </a>\n</blockquote>\n<script async=\"\" charset=\"utf-8\" src=\"https://platform.twitter.com/widgets.js\">\n</script>\n<p></p>\n<p>\n Last December,\n \n  Valve developers fixed several bugs on Anubis\n \n that would spoil players’ gaming experience. Here are all the Anubis-related\n \n  changes\n \n from the official Release Notes for 12/16/2022:\n</p>\n<ul>\n<li>\n  Fixed some spots where guns would fall through the world near the canal\n </li>\n<li>\n  Fixed grenades falling through the floor on A site fountain\n </li>\n<li>\n  Fixed surface properties on models to prevent bullet penetration\n </li>\n<li>\n  Adjusted grenade clips throughout the map\n </li>\n<li>\n  Adjusted player clipping throughout the map\n </li>\n<li>\n  Reduced size of trim at mid\n </li>\n<li>\n  Added collision to signs\n </li>\n<li>\n  Closed various pixel gaps\n </li>\n<li>\n  Minor optimizations.\n </li>\n</ul>\n<p>\n Now that the bugs are fixed, it is much more pleasant to play on Anubis. However, if you are struggling with the newly-added map, check out our\n <strong>\n  Anubis guide\n </strong>\n to find out about various tips and tricks.\n</p>\n<p>\n Roald van der Scheur is one of the Anubis creators. Dutch level designer\n \n  shared insights\n \n about the process of designing the map in an interview for HLTV.\n</p>\n<p>\n Anubis was based on a Half-Life 2 mode in Ancient Egypt settings previously created by the author. Then, he decided to use his work to participate in the Mapcore Mapping Contest for CS:GO community map creators in 2019. The prize pool was $15,000.\n</p>\n<blockquote>\n<p>\n  What I personally like is to design bombsites with some kind of teamwork in mind, where two players could have some crossfires, could cover each other, could help each other out, and can rely on each other. Maybe I do this a little bit too much for the more general player, and that is kind of a risk of my designs, but I think it also provides a little bit more depth, maybe, if you know and figure out how it works and can get some teamwork going on.\n </p>\n<cite>\n  – Roald van der Scheur to HLTV\n </cite>\n</blockquote>\n<p>\n The author spent a lot of time trying to achieve a perfect balance between the sides of T and CT while designing Anubis. He first created this map for esports, but later made a number of adjustments to simplify things for casual gamers.\n</p>\n<p>\n Roald had invited some of the pro players to test Anubis, his creation, but only one unnamed NIP player responded. As a result, this player assisted in remodeling the main entrance to the A site.\n</p>\n<div>\n<figure>\n<img alt=\"Anubis update\" decoding=\"async\" src=\"https://s.4tr.cc/H6x9Fqop.png\">\n</figure>\n</div>\n<p>\n Van der Scheuer did not say how much he sold the map for. He only noted that for each day the map is presented in the game, creators receive a certain compensation, and the income from the sale of the rights for Anubis to Valve is approximately equal to the income from a map being in CS:GO for two years.\n</p>\n<p>\n Explore\n <a href=\"https://bit.ly/3DJLlm8\" target=\"_blank\">\n  our blog\n </a>\n for articles about CS:GO skins, guides, and esports news.\n</p>\n"}},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}