{"pageProps":{"posts":[{"title":"Player preferences for Counter-Strike 2 Features - Hellcase Blog","excerpt":"With Counter-Strike 2 launching this summer, developers will bring new smoke grenade mechanics, upgraded graphics, a new audio system, and more. As we approach the release date, more details about new features will be revealed. However, the CS commun","uri":"counter-strike-2-still-lacks-these-what-features-do-players-want"},{"title":"CS2 vs Valorant: Shooter Comparison - Hellcase Blog","excerpt":"Shooters are one of the most popular game genres that have existed in the gaming market since its inception. During this time, they have attracted millions of players around the world and have become popular in competitive terms. However, with the re","uri":"will-cs2-become-a-valorants-killer"},{"title":"All ABout BLAST Premier Spring Showdown - Hellcase Blog","excerpt":"Only a few days remain until we witness sixteen great CS:GO teams competing at two BLAST Premier Spring Showdown tournaments: European & American. Let’s find out the details about participating teams, dates, and where to watch upcoming matches. Both ","uri":"blast-premier-spring-showdown-whos-playing-where-to-watch"},{"title":"First Counter-Strike 2 LAN Show Match - Hellcase Blog","excerpt":"It has become a tradition of CS:GO tournaments to host show matches before the Grand Finals to warm the audience and set the atmosphere ahead of the high-stakes grand finals, and ESL Pro League Season 17 continued this tradition. However, the show ma","uri":"first-counter-strike-2-lan-show-match"},{"title":"FaZe & Cloud9 ESL Pro League Season 17 Final - Hellcase Blog","excerpt":"The ESL Pro League Season 17 has recently concluded, with an exciting match that left viewers on the edge of their seats. The victorious team received $200,000 from the total prize pool of $850,000, along with 3,000 BLAST Premier Points and invitatio","uri":"faze-and-cloud9-esl-pro-league-season-17-final"},{"title":"New CS2 Details Uncovered By Data Miners - Pt 1- Hellcase Blog","excerpt":"Ladies and gentlemen, Counter-Strike 2 is real and launching this summer. We have already covered the announcement of the biggest update, peeked at the first gameplay streams, and found the best memes about CS2 yet. Data miners dedicate hours examini","uri":"new-cs-2-details-discovered-by-data-miners"},{"title":"Is CS2 Sub-Tick System vs 64-Tick & 128-Tick? - Hellcase Blog","excerpt":"For quite a long time, many CS:GO players preferred third-party platforms like FACEIT and ESEA to regular in-game matchmaking. One of the reasons for that is the difference in the tick rate of the servers. These online gaming platforms offer servers ","uri":"cs2-sub-tick-explained"},{"title":"My Spring Loadout Competition: Winners Determined - Hellcase Blog","excerpt":"The My Spring Loadout competition has concluded and it’s time to recognize the talented participants who showcased their creativity and skills. In the past competition, contestants were required to draw a fictitious or existing item to win a CS:GO sk","uri":"my-spring-loadout-winners-determined"},{"title":"Cloud9 and ENCE ESL Pro League Season 17 - Hellcase Blog","excerpt":"On Thursday, Cloud9 and ENCE both won their matches and secured their spots in the quarterfinals at the ESL Pro League Season 17 in Saint Julian’s, Malta. Here, we will look closer at a review of the match, predictions, and highlights. In article you","uri":"cloud9-and-ence-esl-pro-league-season-17"},{"title":"New Source 2 Gleam Giveaway - Hellcase Blog","excerpt":"Each CS:GO player strives to improve his gaming skills and update his inventory with new interesting skins. We support this endeavor and invite you to participate in the Source 2 giveaway where you can get a valuable item as a gift by completing simp","uri":"source-2-gleam-giveaway-by-hellcase"}],"page":10,"count":131},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}