{"pageProps":{"posts":[{"title":"CS:GO Stickers: Collections from DOTA 2 & Half-Life: Alyx","excerpt":"CS:GO stickers are masterpieces. Their creators search for inspiration from many sources, including other video games. These stickers feature characters or symbols from other games and can be a fun way for fans of those games to show their love for t","uri":"csgo-sticker-collections-inspired-by-other-video-games"},{"title":"New Unique Cases by Hellcase - Trending CS:GO Skins Collection","excerpt":"Consider it a sign if you want to spice up your inventory with some fresh CS:GO skins! Today, we are thrilled to present five new cases by Hellcase that will pleasantly amaze you with their contents. In article you will find: What’s New in Trending C","uri":"new-trending-cases-by-hellcase"},{"title":"The Best CS:GO Stickers of 2023: Lenticular Stickers","excerpt":"CS:GO stickers, the little pieces of virtual flair, have become a staple among the community, allowing players to customize their weapons even more and collect them. Valve regularly introduces new stickers to CS:GO, and it might be difficult to keep ","uri":"best-cs-go-stickers-in-2023"},{"title":"Highlights & Skins Used by Pros of the First CS:GO Major Event","excerpt":"Showtime! CS:GO community has always loved LAN events for spectacular matches, fierce battles between the best pro teams ever, and the atmosphere of the arenas. In this article, we will go back in time to rewatch the greatest highlights of the first ","uri":"7-csgo-skins-used-by-pros-at-the-first-csgo-major-ever"},{"title":"The Best Keyboards For CS:GO 2023: An Ultimate Guide","excerpt":"Gaming devices are a very important component that helps the player to reach their full potential. The keyboard is one of them. At the moment, the market provides us with a huge selection of keyboards, and many people are wondering how to choose the ","uri":"best-gaming-keyboards-for-cs-go"},{"title":"The Best Cheap CS:GO Gloves and Money-Saving Tips","excerpt":"CS:GO gloves are visually pleasing and often prestigious accessories that add flair to your gaming experience. While most of these coveted items come with hefty price tags, there are affordable options to consider acquiring in case you want a pair of","uri":"best-cheap-cs-go-gloves"},{"title":"ESL Challenger Katowice 2023: Highlights and Results","excerpt":"The ESL Challenger Katowice 2023, which took place from June 9 to June 11, was an important tournament in determining which team would qualify for the ESL Pro League Season 18. The winning team earned a prize of $50,000 and 1,000 BLAST Premier points","uri":"esl-challenger-katowice-2023-recap"},{"title":"BLAST Premier Spring Final 2023: Highlights & Results","excerpt":"The BLAST Premier Spring Final 2023 is one of the most important tournaments in the CS:GO scene. It offers great prizes and gives teams a chance to qualify for the upcoming BLAST Premier: World Final 2023. The tournament took place from June 7 to Jun","uri":"blast-premier-spring-final-2023-recap"},{"title":"CS:GO Map Graffiti: Honoring Legendary Esports Highlights","excerpt":"Even after Counter-Strike 2 enters the scene, the iconic legacy of CS:GO esports will be remembered and honored. A number of iconic highlights that happened throughout the long history of competitive CS:GO have already been immortalized in the form o","uri":"in-game-cs-go-graffitis-and-other-memorials"},{"title":"The Journey of \"nitr0\" in eSports: Rise, Retirement, and Farewell","excerpt":"In eSports, many talented players have become legends through their exceptional gaming skills. One such legend is “nitr0.” However, it was announced that Nick Cannellan retired from competitive CS:GO and left Team Liquid after the Intel Extreme Maste","uri":"nitr0-ends-his-cs-go-journey"}],"page":3,"count":131},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}