{"pageProps":{"posts":[{"title":"CS2 Updates: Release of Epic Changes and New Features","excerpt":"On June 7th, Valve released a massive Counter-Strike 2 Limited Test update with numerous changes to gameplay and interface, including adding a new map, reworked buy menu, and other new features. Read further to find out all the details about one of t","uri":"release-of-cs2-updates-and-new-features"},{"title":"Intel Extreme Masters Dallas 2023: Highlights & Winner Revealed","excerpt":"The Intel Extreme Masters Dallas 2023 has recently concluded, unveiling the winner who earned a coveted spot at the Intel Extreme Masters Cologne 2023 and a prize of $100,000. This article will explore the exciting playoff stage and its highlights. I","uri":"intel-extreme-masters-dallas-grand-final"},{"title":"Unveiling CS:GO Weapons Patterns: Impact on Skin Values","excerpt":"When playing CS:GO, you probably wondered why the same skin, with the same quality, can vary greatly in price. And it’s all about the uniqueness of its pattern. In this article, you will learn what CS:GO patterns are, and how they affect the price of","uri":"full-csgo-patterns-guide"},{"title":"IEM Dallas 2023: Group Stage Review & Highlights","excerpt":"The Group Stage of Intel Extreme Masters Dallas 2023 has ended. Despite the modest prize pool of $250,000, this S-Tier tournament offers the opportunity to secure a spot in IEM Cologne 2023 and win the grand prize of $100,000. Now let’s take a closer","uri":"iem-dallas-2023-group-stage-review"},{"title":"Cheap CS:GO Skins: Enhance Your Arsenal Under $1","excerpt":"CS:GO is one of the most popular first-person shooters in the world, and one of the many reasons for its popularity is a wide range of cosmetic items which add flair to the gaming experience. While many high-priced weapon finishes are extremely valua","uri":"cheap-csgo-skins-under-1"},{"title":"CS:GO Ranking System Explained in 2023 - Hellcase Blog","excerpt":"The main goal of any 5v5 shooter is to achieve the highest rank, and CS:GO is no exception. That is possible only with the proper level of skill. Today we will look at the CS:GO ranking system, how it works, and how to rank up faster. Despite the fac","uri":"cs-go-ranking-system"},{"title":"S1mple's Top Knife Highlights & Skins in CS:GO - Hellcase Blog","excerpt":"S1mple’s exceptional skills in CS:GO have garnered him a reputation as one of the game’s most gifted players. His remarkable gameplay, characterized by astonishing flick shots and precise movements, has consistently left fans in awe. Among his many i","uri":"s1mple-top-knife-highlights-and-skins-in-cs-go"},{"title":"Discover the Art of Creating Maps in CS:GO - Hellcase Blog","excerpt":"Despite its age, CS:GO remains one of the most popular games in its genre – having recently broken a record for the most concurrent players. The main reason for such stability and prosperity is game updates that include skins, visual updates, as well","uri":"create-your-own-maps-in-cs-go"},{"title":"New Treasured Antiques Gleam Giveaway - Enter Now & Get Great Skins","excerpt":"Are you ready for the ultimate treasure hunt? The New Treasured Antiques Gleam giveaway is finally here and will be epic. Trust us, you don’t want to miss out on this one. All you have to do is enter the giveaway, do simple tasks, and cross your fing","uri":"treasured-antiques-giveaway-by-hellcase"},{"title":"Explore the Top 10 Most Expensive CS:GO Gloves & Their Value","excerpt":"Gloves fall into the category of the priciest cosmetic items in Counter-Strike: Global Offensive. Throughout the years, these collectibles have turned into a sought-after status symbol within the gaming community. Most players desire to acquire a pai","uri":"the-most-expensive-cs-go-gloves"}],"page":4,"count":131},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}