{"pageProps":{"posts":[{"title":"BLAST.tv Paris Major 2023 Day Three: Highlights & Results","excerpt":"We’re back with updates on the BLAST.tv Paris Major Challengers Stage. Today, we’ll be reviewing the third day of the Paris Major and you will find out who secured the Legend Status and who got eliminated from the tournament. We’ll also share highlig","uri":"blast-tv-paris-major-challengers-stage-day-three-highlights-results"},{"title":"BLAST.tv Paris Major 2023 Day Two: Highlights & Results","excerpt":"The Challengers Stage of the BLAST.tv Paris Major 2023 is in full “blast” ! CS:GO fans worldwide are witnessing the best teams in the world fighting for a spot in the Legends Stage and a chance to lift the trophy at the last CS:GO Major in the histor","uri":"second-day-of-the-blast-tv-paris-major-2023"},{"title":"BLAST.tv Paris Major 2023 Day One: Highlights & Results","excerpt":"This is what we’ve all been eagerly waiting for – the highly anticipated tournament of the year, the BLAST.tv Paris Major 2023. It started on May 8 and will last until May 21, boasting a $1,250,000 prize pool. To understand just how important this to","uri":"first-day-of-the-blast-tv-paris-major-2023"},{"title":"Discover the Best Butterfly Knife Skins in CS:GO - Hellcase Blog","excerpt":"CS:GO players are constantly on the hunt for the best skins to add to their collection, and Butterfly knife skins have gained a lot of popularity throughout the years. These skins not only add a unique touch to the cold steel arms but can also serve ","uri":"best-butterfly-knife-skins-in-cs-go"},{"title":"20 Best Paris Major 2023 Player Autograph Stickers - Hellcase Blog","excerpt":"Paris stickers are here! BLAST.tv Paris Major 2023, the last CS:GO major in the history of the series, is slowly approaching, and fans worldwide finally got their hands on the tournament sticker capsules with participating team’s logos and players’ s","uri":"best-paris-major-player-autograph-csgo-stickers"},{"title":"Celebrating 7 Years of Hellcase: The Best Drops in 7 Years - Hellcase Blog","excerpt":"Hey there, fellow gamers! It’s time to celebrate because your beloved platform, Hellcase, is turning seven years old! Can you believe it? For those new to the scene, Hellcase is the go-to online platform for buying and opening cases filled with skins","uri":"hellcases-lucky-7th-birthday-recalling-the-best-drops"},{"title":"New Final CS:GO Major Gleam Giveaway - Hellcase Blog","excerpt":"It’s time for the New Final CS:GO Major Gleam giveaway! This giveaway celebrates the Final CS:GO Major, with exclusive prizes for fans to win. Read on to find out how to get fantastic prizes. In article you will find: What’s New? All info about New F","uri":"final-csgo-major-giveaway-by-hellcase"},{"title":"Guide for Creating CS:GO Stickers in the Workshop - Hellcase Blog","excerpt":"Creating any kind of content is always an interesting and informative task. Artists, musicians, and other authors spend a lot of time and effort to bring their creations to perfection. This also goes for content creators in CS:GO. In this guide, we w","uri":"create-your-own-cs-go-stickers-in-the-workshop"},{"title":"CS:GO Pro Players Nicknames & Their Origins - Hellcase Blog","excerpt":"One of the secrets of becoming a popular CS:GO pro player, streamer, or content maker is a catchy nickname your fans will know you by. It’s best to be creative with your nickname and try to come up with a unique and easy-to-remember one. If you are u","uri":"csgo-pro-players-nicknames-and-stories-behind-them"},{"title":"Unleash the Power of CS:GO Dragon-Themed Skins - Hellcase Blog","excerpt":"People of Chinese heritage worldwide celebrate Chinese New Year, also known as the Spring Festival. It is a time to come together with loved ones and friends to celebrate the start of the new year. Dragons symbolize good fortune and are a big part of","uri":"csgo-dragon-themed-skins"}],"page":6,"count":131},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}