{"pageProps":{"posts":[{"title":"The Best CS:GO Reptile Themed Skins - Hellcase Blog","excerpt":"If you adore the beauty of cold-blooded creatures, you are in the right place. Cosmetic items in CS:GO add a unique and distinctive look to players’ weapons, and reptile-themed skins are a great way to stand out in the crowd. Whether you’re a fan of ","uri":"csgo-reptile-themed-skins"},{"title":"10 Best Anubis Collection CS:GO Skins to Try Out- Hellcase Blog","excerpt":"Well, buckle up, as Valve just released the new Anubis Collection! With BLAST.tv Paris CS:GO Major approaching, one thing that needed to be added is a set of new skins for an Anubis Souvenir Package, as this will be the first (and the last) CS:GO Maj","uri":"best-csgo-skins-from-the-new-anubis-collection"},{"title":"Anti-Cheat: How To Avoid Cheaters in CS:GO - Hellcase Blog","excerpt":"Counter-Strike Global Offensive is an extremely popular video game millions of players worldwide enjoy. Among many factors, it became admired for its competitive gameplay, thriving esports scene, and requiring people to work together to win matches. ","uri":"avoid-cheaters-in-cs-go"},{"title":"The Best Anime-Themed CS:GO Skins & Loadouts - Hellcase Blog","excerpt":"The popularity of Japanese animation, or anime, has skyrocketed worldwide in recent years, its influence reaching far and wide, including the CS:GO community. However, a growing trend of anime-themed CS:GO weapon skins has emerged, capturing the imag","uri":"anime-themed-csgo-skins-and-loadouts"},{"title":"Intel Extreme Masters Rio 2023 Final Review - Hellcase Blog","excerpt":"The Intel Extreme Masters Rio 2023 has recently concluded, and the final match was epic! Today, we’ll look at the Playoff Stage results and find out who received $100,000 and a deserved ticket to IEM Cologne 2023. In case you missed all the action an","uri":"intel-extreme-masters-rio-2023-final"},{"title":"7 Best M4A4 Skins Under $10 – Hidden Gems - Hellcase Blog","excerpt":"M4A4 is one of the most popular weapons in CS:GO. Finding that one perfect M4A4 skin might be challenging, especially if you are on a budget. However, we’ve scoured the market and gathered here the best affordable options for you to explore. This art","uri":"best-m4a4-skins-under-ten-usd"},{"title":"What is Hellcase Trade Up a Contract? - Hellcase Blog","excerpt":"Do you get high from playing CS:GO, Dota or Rush, but get upset like a child when you open a case with items you don’t need? Now, these unpleasant sensations are in the past. Hellcase allows gamers to exchange unwanted game items for the items of the","uri":"csgo-trade-up-contracts-guide"},{"title":"IEM Rio 2023 Day 2: Group Stage Match Review","excerpt":"The second day of IEM Rio 2023 has ended. While there were fewer games than on the first day, the competition was no less fierce. In this article, we’ll explore the key moments of the second day to find out which teams moved on to the Play-off and wh","uri":"second-day-iem-rio-2023-overview-results"},{"title":"New Dragon Lore Dropland - Unique CS:GO Packs - Hellcase Blog","excerpt":"Many CS:GO players admire the beauty of one of the most valuable and expensive AWP skins in the history of the game – Dragon Lore. We’re also crazy about it, and that’s why we’ve prepared a new Dropland in the style of Dragon Lore for you to enjoy. D","uri":"new-dragon-lore-dropland"},{"title":"An Overview of the First Day of IEM Rio 2023 - Hellcase Blog","excerpt":"In Rio, one of the important tournaments for the CS:GO world in 2023, the IEM Rio 2023, is taking place. It started on April 17 and will last until April 23. Today, we will look at the first day of the competition and discuss what IEM 2023 is in gene","uri":"first-day-of-the-iem-rio-2023-tournament"}],"page":7,"count":131},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}