{"pageProps":{"posts":[{"title":"Cheap AK-47 Skins: Best Skins for Under $10 | Hellcase Blog","excerpt":"Any CS:GO veteran will agree that the right skin, such as AK-47 skins, can make a huge difference in your gaming experience. As the market is flooded with all types of CS:GO skins, it might be quite a challenge to find that perfect skin that matches ","uri":"best-ak-47-skins-under-10"},{"title":"BLAST.tv Paris Major: European RMR B & American RMR - Hellcase Blog","excerpt":"BLAST.tv Paris Major 2023 qualifying matches have ended, and we finally know which teams will be competing for the prize pool of $1,250,000 during the Main Stage of the last CS:GO Major in May. Today, we’ll look at the results of European RMR B & Ame","uri":"blast-tv-paris-major-2023-european-rmr-b-american-rmr-final-overview"},{"title":"New IEM Rio 2023 Collection: Cases by Hellcase - Hellcase Blog","excerpt":"We are pleased to introduce you to our new cases. You will find a case dedicated to your favorite team among them. In this article, we will explore in greater detail each unique case. Let’s get started! In article you will find: What Cases Has Hellca","uri":"iem-rio-collection-csgo-cases-by-hellcase"},{"title":"The Best CS:GO Pro Players and Their Skins - Hellcase Blog","excerpt":"Each January, HLTV.org compiles a list of the world-greatest CS:GO pro players of the year. By now, you probably know all the names of the players who were acknowledged as the best players of 2022. However, do you know what CS:GO skins they play with","uri":"csgo-pro-players-skins"},{"title":"New Legacy Gleam Giveaway - Hellcase Blog","excerpt":"Every CS:GO player wants to spice up their inventory with some sick new skins. And guess what? Our team is down with that too! So, we’re hyped to invite you to join the Legacy giveaway and get a chance to score some prizes by doing easy tasks. So, le","uri":"legacy-gleam-giveaway-by-hellcase"},{"title":"IEM Rio 2023 Tournament: ESL Pro Tour - Hellcase Blog","excerpt":"Next week, Rio de Janeiro will host Intel Extreme Masters, the much-anticipated S-Tier tournament organized by ESL. Sixteen top-tier teams from around the globe will compete for a staggering prize pool of $250,000 and a slot at the IEM Cologne 2023. ","uri":"iem-rio-2023"},{"title":"Cheap AWP Skins: Best Skins for Under $10 | Hellcase Blog","excerpt":"You might be hitting the most insane no-scope wall-bang highlights with your AWP skins, but it’s not as pleasant to rewatch and share these clips if you’re using a default skin, is it? An eye-catching AWP skin is a must-have item for all sniper playe","uri":"best-awp-skins-under-10"},{"title":"Overpass Molotov Tutorial - Guide with Illustrations- Hellcase Blog","excerpt":"The Overpass is one of the most complicated maps in CS:GO. Some pro players hate this map due to its complex construction. We recommend it to more experienced players who have already mastered the basic mechanics and concepts of the game. If you thin","uri":"overpass-molotov-complete-tutorial"},{"title":"Recap of BLAST.tv Paris Major 2023 Europe RMR A - Hellcase Blog","excerpt":"On April 6-9, the BLAST.tv Paris Major 2023 Europe RMR A CS:GO matches took place, determining the 1-st half of the teams representing Europe in the upcoming BLAST.tv Paris Major 2023. BLAST.tv Paris Major 2023 Europe RMR B will start on April 11, so","uri":"blast-tv-paris-major-2023-rmr-europe-a-final-overview"},{"title":"CS:GO Team Color Loadouts: Ranked 10th - 5th - Hellcase Blog","excerpt":"Rep your team with pride! If you are a die-hard fan of a particular CS:GO team and want to show your support on the server, this article is for you. Here, we assembled the best CS:GO loadouts in the colors of your favorite teams that will let you rep","uri":"skin-loadouts-team-colors"}],"page":8,"count":131},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}