{"pageProps":{"posts":[{"title":"BLAST.tv Paris Major 2023 RMR Europe A: Overview & Highlights - Hellcase Blog","excerpt":"On April 6, BLAST.tv Paris Major Europe RMR A started. The tournament is taking place in Denmark, where 16 teams are competing. The top eight teams will advance to the BLAST.tv Paris Major and three more teams will get to the European RMR Decider. Th","uri":"blast-paris-major-europe-rmr-a-2023-overview"},{"title":"CS:GO Autoexec: How to Create CFG File - Hellcase Blog","excerpt":"Counter-Strike:Global Offensive is considered one of the most detailed shooters in terms of mechanics and physics. It has quite a few options that allow the player to customize the game for themselves. This article will focus on the config and Autoex","uri":"csgo-config-autoexec-guide"},{"title":"Top 10 CS:GO Skins with Easter Eggs - Hellcase Blog","excerpt":"CS:GO skins with easter eggs are more than just cosmetic enhancements, as they are a canvas for creativity and hidden surprises. Throughout the years, skin authors have incorporated subtle references or secret features into their designs. This articl","uri":"csgo-skins-with-easter-eggs"},{"title":"BLAST.tv Paris Major 2023 RMR Tournament - Hellcase Blog","excerpt":"First for France, first for BLAST, and last for CS:GO, the BLAST.tv Paris Major 2023 RMR will be held in May, boasting a $1,250,000 prize pool sixteen best teams will compete for. But before the year’s main event kicks off, participants need to be de","uri":"blast-tv-paris-major-2023-rmr"},{"title":"BLAST Premier Spring American & European Showdown - Hellcase Blog","excerpt":"The BLAST Premier Spring Showdown 2023 for Europe and America has just ended, and we have the results! We’ll discuss the BLAST Premier: Spring American Showdown and the Spring European Showdown, starting with a matching overview and ending with the w","uri":"blast-premier-spring-american-european-showdown-2023"},{"title":"CS:GO Team Color Loadouts: Ranked 5th - 1th - Hellcase Blog","excerpt":"Show off the colors of your favorite teams on the server! In this two-part article, we compiled the best loadouts of skins to match the colors of the greatest CS:GO teams, according to HLTV. Find a loadout dedicated to your favorite team here to see ","uri":"skin-loadouts-team-colors-2"},{"title":"Top CS:GO Tournaments in 2023 - Hellcase Blog","excerpt":"For more than ten years, CS:GO has been one of the leading games in eSports, with a massive following and some of the most prestigious tournaments in the industry. The tournament schedule is jam-packed, making it a little hard to keep track of all th","uri":"biggest-csgo-esports-events-of-2023"},{"title":"AWP | Doodle Lore Replaced with AWP | Duality - Hellcase Blog","excerpt":"Ah ****, here we go again. Yet another plagiarism scandal broke out in the CS:GO community. This time, it’s about AWP | Doodle Lore. On February 10, Valve pushed the “Case, Capsule, Kit, Oh My!” update that brought in a new weapon case, a new sticker","uri":"awp-doodle-lore-deleted-is-m4a4-temukau-next-in-line"},{"title":"FaZe Clan's Epic Journey to Intel Grand Slam Season 4 - Hellcase Blog","excerpt":"Over several years, professional Counter-Strike: Global Offensive teams have been fighting in epic battles seeking to claim this elite title of the Intel Grand Slam winners and the ultimate $1,000,000 prize. In this article, we will go over FaZe Clan","uri":"the-epic-journey-of-faze-clan-on-the-road-to-intel-grand-slam-season-4"},{"title":"Reactions & Thoughts of Pro Players About CS 2 - Hellcase Blog","excerpt":"Probably every single person in the world who has played computer games has heard of CS. In different series, this game has found millions of fans and has become one of the leading disciplines in eSports. But progress does not stand still, and we are","uri":"the-reaction-and-thoughts-of-pro-players-about-cs-2"}],"page":9,"count":131},"mail":{"address":"dota2sites@gmail.com"},"site":{"short_name":"Hellcase","name":"Hellcase.com - CS:GO Cases you should try! | Best drop in custom created cases","description":"Hellcase Promo/Referral Codes, best csgo case opening site hellcase","avatar":"j8RqaCPi","promos":[{"code":"orksgaming","bonus":"$0.70 for Free, +10% to balance refill, Daily CS:GO Random Item, Balance, War Tags","uid":"XnabMPWX"}]},"navis":[{"name":"Home","title":"Home page","url":"/","order":0},{"name":"Contact","title":"Contact","url":"/contact","order":0},{"name":"Privacy","title":"Paivacy","url":"/privacy","order":0}],"__N_SSG":true}